{
  "introduction": "Hello! I'm <0>Pedro Moratelli</0>, a <1>Tech Lead</1>.",
  "skills": {
    "title": "Skills",
    "list": [
      "Team Leadership",
      ".NET Core",
      "Node.js",
      "React & Next.js",
      "Flutter",
      "TypeScript",
      "Nest.JS",
      "Kafka",
      "Docker & Kubernetes",
      "Azure & AWS",
      "CI/CD",
      "International Projects"
    ]
  },
  "myJourney": {
    "title": "My Journey So Far",
    "school": {
      "paragraph_1": "My software development journey began at <0>SENAI</0> in Florianópolis.",
      "paragraph_2": "That is where I learned the fundamentals of web development, including React, Node.js, and SQL, alongside the principles of good software practices."
    },
    "trackli": {
      "dates": "Jan 2020 - Apr 2020",
      "paragraph_1": "My first role in the industry was an internship at <0>Trackli</0>.",
      "paragraph_2": "During my time there, I helped modernise the company's device monitoring platform, developing a new frontend with HTML, CSS, JavaScript, and jQuery, and integrating it with the existing PHP backend."
    },
    "certi": {
      "dates": "Apr 2020 - Jul 2021",
      "paragraph_1": "At <0>Fundação CERTI</0>, I worked on building Minimum Viable Products for major clients like Siemens. This included developing a Flutter app that sent data from medical devices to an AWS Lambda API.",
      "paragraph_2": "I also built client dashboards using React, Node.js, and TypeScript. I also took on Scrum Master duties for the team, ensuring we delivered our solutions using agile methods.",
      "paragraph_3": "This role taught me a great deal about agile development. Whilst at CERTI, I also began my Technologist degree in Analysis and Development of Computer Systems at <0>Anhanguera</0> to formalise my knowledge.",
      "info_bits": [
        "Fundação CERTI is an innovation centre that builds cutting-edge solutions for major national and international clients."
      ]
    },
    "philips": {
      "dates": "Aug 2021 - Dec 2021",
      "paragraph_1": "I worked in maintaining and developing new features for <0>Tasy</0>, an integrated healthcare management system used by more than 900 health institutions in Brazil",
      "paragraph_2": "Further improved my Web Development skills using AngularJS, JavaScript, and Java"
    },
    "zallpy": {
      "dates": "Dec 2021 - Present",
      "paragraph_1": "I joined <0>Zallpy Digital</0> to integrate a team focused on Mobile Full Stack Development. We develop features for BMW's apps: <1>My BMW</1> and <2>MINI</2>",
      "paragraph_2": "It's fun to work again with Flutter and TypeScript. I also get the chance to learn and apply modern software design patterns, like <0>BFFs</0>",
      "paragraph_3": "Now as a Tech Lead, I lead a team of six engineers responsible for the notification platform, which handles over 11 million daily notifications. I mentor my team, architect new microservices in .NET and NestJS, and focus on predictable delivery, which has helped us increase our team's throughput by 26%.",
      "paragraph_4": "Working at this scale requires close collaboration with distributed teams in Germany, Portugal, and China, all whilst maintaining a defect rate under 4%. It is a fantastic environment for growing in high-quality, global software delivery.",
      "info_bits": [
        "The BMW Group's applications serve over 10 million active users and demand extremely high standards for code quality, testing, and DevOps.",
        "My role involves daily collaboration in English and French with distributed teams across Brazil, Germany, Portugal, and China."
      ]
    }
  },
  "today": {
    "title": "Today",
    "paragraph_1": "Today, I am focused on leading teams and tackling complex, large-scale technical challenges. I am always looking for opportunities to build reliable, high-impact software in global environments and to mentor others, helping them grow and succeed in their own careers.",
    "paragraph_2": "To complement my experience in global collaboration, I am actively seeking on-site or hybrid opportunities in North America and Europe. My full professional fluency in English and French, along with my German skills, allows me to integrate seamlessly into diverse, international teams."
  },
  "footer": {
    "linkedIn": "Feel free to connect with me on <0>LinkedIn</0>",
    "blog": "Check out <0>my blog</0> to read my thoughts on tech and the market",
    "resume": "Looking for <0>my resumé?</0> Click the icon above to read it"
  }
}
