{
  "introduction": {
    "paragraph1": "Bonjour! Je suis <0>Pedro Moratelli</0>.",
    "paragraph2": "Je suis un <0>Tech Lead</0> spécialisé dans les applications web et mobiles haute performance pour des <1>clients internationaux</1>."
  },
  "clientsTitle": "Ils me font confiance",
  "skills": {
    "title": "Compétences",
    "list": [
      "Leadership d'équipe",
      ".NET Core",
      "Node.js",
      "React & Next.js",
      "Flutter",
      "TypeScript",
      "Nest.JS",
      "Kafka",
      "Docker & Kubernetes",
      "Azure & AWS",
      "CI/CD",
      "Projets internationaux"
    ]
  },
  "myJourney": {
    "title": "Mon Parcours Jusqu'à Présent",
    "school": {
      "dates": "2019 - 2020",
      "title": "Éducation",
      "photoCaption": "CLASSE AU SENAI",
      "paragraph1": "Mon parcours en développement de logiciels a débuté au <0>SENAI</0> à Florianópolis.",
      "paragraph2": "C'est là que j'ai appris les fondements du développement web, y compris React, Node.js et SQL, ainsi que les principes des bonnes pratiques de développement.",
      "tags": [
        "React",
        "Node.js",
        "SQL"
      ]
    },
    "trackli": {
      "dates": "Janv 2020 - Avr 2020",
      "paragraph1": "Mon premier rôle dans l'industrie a été un stage chez <0>Trackli</0>.",
      "paragraph2": "Durant cette période, j'ai aidé à moderniser la plateforme de suivi des appareils de l'entreprise, en développant un nouveau frontend avec HTML, CSS, JavaScript et jQuery, et en l'intégrant au backend PHP existant.",
      "tags": [
        "HTML",
        "CSS",
        "JavaScript",
        "jQuery",
        "PHP"
      ]
    },
    "certi": {
      "dates": "Avr 2020 - Juil 2021",
      "paragraph1": "À la <0>Fundação CERTI</0>, j'ai travaillé à la création de produits minimums viables (MVPs) pour des clients majeurs tels que Siemens. Cela comprenait le développement d'une application Flutter qui collectait des données à partir d'appareils médicaux et les envoyait à une API AWS Lambda.",
      "paragraph2": "J'ai également créé des tableaux de bord pour les clients en utilisant React, Node.js et TypeScript. J'ai aussi assumé les fonctions de Scrum Master pour l'équipe, assurant la livraison de nos solutions en utilisant les méthodes agiles.",
      "paragraph3": "Ce rôle m'a beaucoup appris sur le développement agile. Pendant mon séjour à CERTI, j'ai aussi commencé mon diplôme de Technologue en Analyse et Développement de Systèmes à <0>Anhanguera</0> pour formaliser mes connaissances.",
      "infoBits": [
        "Fundação CERTI est un centre d'innovation qui crée des solutions de pointe pour de grands clients nationaux et internationaux."
      ],
      "tags": [
        "Flutter",
        "React",
        "Node.js",
        "TypeScript",
        "AWS",
        "PostgreSQL"
      ]
    },
    "philips": {
      "dates": "Août 2021 - Déc 2021",
      "paragraph1": "Je suis ensuite passé chez <0>Philips</0>, où j'ai travaillé à la maintenance et à l'évolution de <1>Tasy</1>, un système de gestion hospitalière à grande échelle utilisé par des centaines d'hôpitaux et gérant des millions de dossiers patients.",
      "paragraph2": "Ce rôle a renforcé mes compétences en logiciels d'entreprise, car j'ai utilisé Java, Angular et JavaScript pour remanier le code, corriger des bogues et implémenter de nouvelles fonctionnalités demandées par les clients.",
      "tags": [
        "Java",
        "Angular",
        "JavaScript"
      ]
    },
    "zallpy": {
      "dates": "Déc 2021 - Présent",
      "photoCaption": "AU BUREAU",
      "paragraph1": "J'ai rejoint <0>Zallpy Digital</0> pour intégrer une équipe travaillant directement avec le groupe BMW sur leurs applications mobiles mondiales: <1>My BMW</1> et <2>MINI</2>.",
      "paragraph2": "En tant que développeur Full Stack, j'ai conçu l'onglet \"Services\", une fonctionnalité centrale utilisée plus de 5 millions de fois par jour, en bâtissant à la fois le frontend en Flutter et le Backend-for-Frontend (BFF) en NestJS. Ce rôle m'a permis d'approfondir mon expertise des <0>architectures BFF</0> et d'autres modèles de conception modernes.",
      "paragraph3": "Aujourd'hui, en tant que Tech Lead, je dirige une équipe de six ingénieurs responsables de la plateforme de notifications, qui gère plus de 11 millions de notifications quotidiennes. J'agis comme mentor pour mon équipe, je conçois de nouveaux microservices en .NET et NestJS, et <0>je me concentre sur la livraison prévisible</0>, ce qui nous a aidés à augmenter le throughput de l'équipe de 26%.",
      "paragraph4": "Travailler à cette échelle exige une <0>collaboration étroite avec des équipes distribuées en Allemagne, au Portugal et en Chine</0>, tout en maintenant un taux de défauts inférieur à 4%. C'est un environnement fantastique pour grandir en matière de livraison de logiciels de haute qualité à l'échelle mondiale.",
      "infoBits": [
        "Les applications du groupe BMW desservent plus de 10 millions d'utilisateurs actifs et exigent des normes de qualité de code, de tests et de DevOps extrêmement élevées.",
        "J'ai également développé un outil interne basé sur React qui permet aux équipes de support et de marketing de gérer des campagnes et d'envoyer des notifications efficacement."
      ],
      "tags": [
        ".NET",
        "Node.js",
        "React",
        "TypeScript",
        "NestJS",
        "Flutter",
        "Next.js",
        "Azure",
        "CI/CD"
      ]
    }
  },
  "today": {
    "title": "Aujourd'hui",
    "paragraph1": "Aujourd'hui, je me concentre sur la direction d'équipes et la résolution de défis techniques complexes et à grande échelle. Je suis toujours à la recherche d'opportunités pour bâtir des logiciels fiables et à fort impact dans des environnements mondiaux, et pour agir comme mentor auprès d'autres personnes, les aidant à se développer et à réussir dans leur propre carrière.",
    "paragraph2": "Pour compléter mon expérience en collaboration mondiale, je suis activement à la recherche d'opportunités sur site ou en mode hybride en Amérique du Nord et en Europe. Ma maîtrise professionnelle complète de l'anglais et du français, ainsi que mes compétences en allemand, me permet de m'intégrer facilement au sein d'équipes internationales et diversifiées."
  },
  "footer": {
    "blog": "Consultez <0>mon blog</0> pour mes réflexions sur la tech",
    "linkedIn": "Mon profil correspond à un poste ? Discutons sur <0>LinkedIn</0>",
    "github": "Curieux de voir mon code ? Consultez mon <0>GitHub</0>"
  }
}
